{
  "id": "1mo41j9",
  "title": "Facialteam rhinoplasty 1.5 years post op - is it too upturned?",
  "author": "mortalboyk1ng",
  "selftext": "pic 1-3 are of my current nose, pic 4-5 were my previous nose, pic 6-7 were what i showed my surgeon. I need an unbiased opinion because i feel like it looks too upturned (lowkey resembling those ski slope noses) :/ especially considering the photos i showed were more natural looking and less upward slanted. i also feel like it doesn’t fit my face for this reason. am i right to think this? and does it look natural? please be honest, everyone around me says it’s fine but i really don’t think it is ",
  "score": 50,
  "url": "https://www.reddit.com/gallery/1mo41j9",
  "num_comments": 20,
  "created_utc": "2025-08-12T09:29:11Z",
  "comments": [
    {
      "id": "n89l8qz",
      "author": "Dangerous_Mix5804",
      "body": "This would be a matter of personal preference - some people want straight some people want sloped. I think your nose looks cute - it fits your face well",
      "score": 27,
      "created_utc": "2025-08-12T10:38:34Z"
    },
    {
      "id": "n89t8zf",
      "author": "SparkleK_01",
      "body": "Your nose looks terrific with your facial lines.  What a lovely silhouette!",
      "score": 13,
      "created_utc": "2025-08-12T11:39:56Z"
    },
    {
      "id": "n89lzat",
      "author": "sadmio",
      "body": "I think your nose is really nice and complements your face well. I don't think it looks too upturned. I feel like pic 6 and 7 the nose looks too long? Of course that's just my opinion",
      "score": 11,
      "created_utc": "2025-08-12T10:44:46Z"
    },
    {
      "id": "n89serv",
      "author": "Sudden_Teaching_8688",
      "body": "Stunning!! I'd call it perfect even, and very feminine",
      "score": 9,
      "created_utc": "2025-08-12T11:33:52Z"
    },
    {
      "id": "n89p6nv",
      "author": "vs-188",
      "body": "You have a straight bridge with a (only somewhat) raised tip. You do not have a scooped out / dipped bridge. One of the requirements of the \"ski-slope nose\" is a dipped bridge.\n\nI noticed in your photos that your posture changes slightly and each time it sort of has an effect on how the tip is seen. In some photos it appears more raised then others; however, this is in direct relationship to how raised your chin is in the photo. When your chin is most neutral your nose tip looks more neutral.\n\nMy conclusion is that you're overthinking this and NO (actually HELL NO) your tip is NOT too upturned.\n\nFinal points:\n\n- Rhinoplasty is among the most complex surgeries to make precision alterations. Revisions are exponentially more difficult and even fewer surgeons are great at them... Sometimes you need to know when to leave well enough alone. I think this is one of those times. Your nose looks great, it's in balance with your face, and you look beautiful. This is a great and extremely enviable aesthetic outcome and you might benefit from reflecting on that and focusing on enjoying the gift of beauty (and access). If what was shared above is somehow not enough, it's possible you're experiencing dysmorphia (different from dysphoria) which isnt suited to treatment with more surgery and would be best approached through therapy.\n\n- Be mindful of how you let what others say affect you. Regardless of how it's intended, feedback on our looks can be difficult to receive. Some people make rude off hand remarks, completely uninformed, and without consideration of its objectiveness or compassion. My personal opinion is that this is what your mother did. Only u will know what is in her heart and intent... It's possible, maybe even likely, she just had a human moment of adjusting to the new face of her child and said something out loud that was both inaccurate and hurtful without thinking it through or intending it. If u think that's the case, let it slide. It can take time for our loved ones to adjust just like it can take time to personally adjust to changes in appearance after surgery.\n\nBe gentle with yourself and wishing you the best.",
      "score": 7,
      "created_utc": "2025-08-12T11:09:49Z"
    },
    {
      "id": "n89u8en",
      "author": "Any-Comfort-1671",
      "body": "One of the things I regret is getting rhinoplasty with a FFS surgeon. Their view on noses are absolutely terrible. They tend to upturn the nose a bit too much, and recommend a ski slope. Ski slope noses don’t fit everyone even if it’s “feminine”, especially if you aren’t white or have a baby face.",
      "score": 5,
      "created_utc": "2025-08-12T11:46:58Z"
    },
    {
      "id": "n89u1o5",
      "author": "EmilyTheTaller",
      "body": "Looks like a normal nose to me",
      "score": 3,
      "created_utc": "2025-08-12T11:45:40Z"
    },
    {
      "id": "n89nqav",
      "author": "AdHefty1613",
      "body": "I honestly love it. It looks feminine and not too upturned as it goes well with the bridge.\n\nI would request for something similar myself as the nose tends to drop with age and few years after surgery.",
      "score": 2,
      "created_utc": "2025-08-12T10:58:40Z"
    },
    {
      "id": "n8at922",
      "author": "AutumnGlow33",
      "body": "No, it’s super cute!",
      "score": 1,
      "created_utc": "2025-08-12T15:06:16Z"
    },
    {
      "id": "n8bhp3q",
      "author": "Kass-Is-Here92",
      "body": "They did a beautiful job on it!",
      "score": 1,
      "created_utc": "2025-08-12T17:06:32Z"
    },
    {
      "id": "n89mtdv",
      "author": "Flowersofpain",
      "body": "no it is good, because the nose tip will come down after a couple of years",
      "score": 1,
      "created_utc": "2025-08-12T10:51:32Z"
    },
    {
      "id": "n89sikj",
      "author": "Wh1ppetFudd",
      "body": "No, it is not too up turned though it doesn't need to be that upturn. I also don't see what was wrong with your original nose. It was still an attractive and feminine looking nose.",
      "score": 0,
      "created_utc": "2025-08-12T11:34:39Z"
    },
    {
      "id": "n89ut64",
      "author": "Adulations",
      "body": "Looks cute and I know people who would kill for that nose.",
      "score": 0,
      "created_utc": "2025-08-12T11:50:57Z"
    },
    {
      "id": "n8a48en",
      "author": "Caro________",
      "body": "I think it looks cute. You're very lucky.",
      "score": 0,
      "created_utc": "2025-08-12T12:51:28Z"
    },
    {
      "id": "n8a6fnr",
      "author": "rawrcutie",
      "body": "I think it looks perfect on you. I don't see what could be better. The risks of further rhinoplasties definitely do not seem worth getting your ideal nose.",
      "score": 0,
      "created_utc": "2025-08-12T13:04:14Z"
    },
    {
      "id": "n8ahjv9",
      "author": "sherryax",
      "body": "I think it’s super cute I actually screenshot it as nose inspiration for when I get my FFS",
      "score": 0,
      "created_utc": "2025-08-12T14:06:03Z"
    },
    {
      "id": "n8ari7s",
      "author": "Tristookthepiss",
      "body": "Gosh its perfect.. \nNot usually a fan of the facialteam as they seem to charge maximum fees for minimal amounts of surgical feminine change but that nose looks proportional feminine and pretty. \nCongratulations 🎉",
      "score": 0,
      "created_utc": "2025-08-12T14:57:26Z"
    },
    {
      "id": "n8b2385",
      "author": "Hour_Media2490",
      "body": "It ultimately comes down to personal preference. Having said that, I think it looks quite beautiful and feminine. Keep in mind that the tip will eventually drop a bit more over time. You can also massage it to loosen things up and soften scar tissue.",
      "score": 0,
      "created_utc": "2025-08-12T15:49:57Z"
    },
    {
      "id": "n89pw7b",
      "author": "[deleted]",
      "body": "[deleted]",
      "score": 2,
      "created_utc": "2025-08-12T11:15:11Z"
    },
    {
      "id": "n89qbdy",
      "author": "vs-188",
      "body": "Adding another thought... The last photo in your set is the one that's most neutrally positioned (gauging from your chin position). Looking at just that photo, Facialteam did an incredible job! Its the type of Rhinoplasty after photo that would get them a thousand new bookings if posted on their socials. Among the best I've seen of their work.",
      "score": 1,
      "created_utc": "2025-08-12T11:18:23Z"
    }
  ]
}