{
  "id": "1moas1s",
  "title": "Help with washing hair post FFS",
  "author": "supkicks15",
  "selftext": "Hey y'all. I got my ffs done 5 days ago with Mardirossian. My hair has been matter up behind my head in a bandage for several days atp, and its supper matted and tangled. I have a lot of anxiety about taking my first shower and working to detangle my hair, especially with allof the stitches. i have super curly hair normally and this level of tangled in my hair typically is pretty involved to get out. i normally just use a wet brush to detangle before using hair products and was wondering if there are any recommendations on any other things to do, as to not go too hard on my hair, but to also fix the matted mess im dealing with right now. thanks in advance.",
  "score": 3,
  "url": "https://www.reddit.com/r/Transgender_Surgeries/comments/1moas1s/help_with_washing_hair_post_ffs/",
  "num_comments": 4,
  "created_utc": "2025-08-12T14:48:47Z",
  "comments": [
    {
      "id": "n8armf7",
      "author": "RevToni",
      "body": "Go slow and be very gentle and patient. \n\nI’m 12 days post op. I was cleared to remove my wraps after 72 hours and then took my first full shower with hair washing two days later. It felt like I was in the shower FOREVER just trying to gently, slowly detangle without touching the stitches and staples too much. \n\nYMMV, but be prepared for LOTS of hair to come out in the first couple of washes. Just know that that is normal. Many people experience shock hair loss around the incision site, and usually it grows back. \n\nGood luck!",
      "score": 2,
      "created_utc": "2025-08-12T14:58:01Z"
    },
    {
      "id": "n8atv9a",
      "author": "supkicks15",
      "body": "yea ive heard that i should expect fora lot to fallout. do i need to use any special products on it to help with the detangling or will a slow careful miticulous brushing be sufficient?",
      "score": 2,
      "created_utc": "2025-08-12T15:09:22Z"
    },
    {
      "id": "n8axj90",
      "author": "RevToni",
      "body": "I just used my regular shampoo and one of those really big, wide-toothed combs and went real slow. After shampooing I put on a hydrating mask for about 5 minutes and then rinsed it out and combed through it again.",
      "score": 1,
      "created_utc": "2025-08-12T15:27:32Z"
    }
  ]
}