{
  "id": "icsahu",
  "title": "When Surgeons Fail Their Trans Patients on Gender Confirming Surgery",
  "author": "[deleted]",
  "selftext": "",
  "score": 1038,
  "url": "https://jezebel.com/when-surgeons-fail-their-trans-patients-1844774990?rev=1597854733082",
  "num_comments": 150,
  "created_utc": "2020-08-19T17:35:23Z",
  "comments": [
    {
      "id": "g24lgfd",
      "author": "Forgetwhatitoldyou",
      "body": "My \"oh fuck\" meter hit 110% when I saw Dr. Rumer's name at the end of the first paragraph.  Don't go to her, seriously.",
      "score": 507,
      "created_utc": "2020-08-19T18:17:03Z"
    },
    {
      "id": "g251mi8",
      "author": "letthisegghatch",
      "body": "I REALLY hope this article is enough to end Rumer's career, but I'm not holding my breath...",
      "score": 221,
      "created_utc": "2020-08-19T20:18:31Z"
    },
    {
      "id": "g24q1ai",
      "author": "MyNewTransAccount",
      "body": "The sad part is these awful surgeons are almost impossible to sue so they just keep operating and notching unsuspecting patients. 🤬",
      "score": 174,
      "created_utc": "2020-08-19T18:50:27Z"
    },
    {
      "id": "g26ctec",
      "author": "52jag",
      "body": "I have seen some of Dr. Rumor’s work on the Wiki and in my humble opinion even the best of her work doesn’t look like a vulva.  I know some folks have bad  dysphoria and want surgery asap, but really we only get one shot.   From what I’ve seen of her work, I wouldn’t trust Dr. Rumer to give me a botox injection, let alone srs. \n\nWith some surgeons, they do not have a lot of training, but I think others just don’t have any talent.   This leads to a lot of outcomes with significant complications that the doctors don’t know how to repair.  Any surgery has the risk of poor or unwanted outcomes, but as the article points out we have no way of knowing which doctor is more likely to have complications and the extent and effectiveness of follow-up care.",
      "score": 116,
      "created_utc": "2020-08-20T03:13:44Z"
    },
    {
      "id": "g25y1sk",
      "author": "sucks_to_your_asmr",
      "body": "Katelyn Burns is probably my favorite journalist nowadays, especially when it comes to trans issues. I can hardly imagine anyone better suited to bringing Rumer down.",
      "score": 75,
      "created_utc": "2020-08-20T00:57:18Z"
    },
    {
      "id": "g680zjf",
      "author": "danaEscott",
      "body": "Rumer falsifies her records and then will accuse the patient of mental health issues.   Always fun.",
      "score": 76,
      "created_utc": "2020-09-22T15:37:29Z"
    },
    {
      "id": "gd815tb",
      "author": "HealthyCompote9573",
      "body": "The problem is that the community does not stand together. As I stated previously post Brassard in Montreal make us sign a a non picture disclosure form 30 minutes prior to surgery, then go on to perform a a low quality SRS technique based on speed and quantity and not quality and result. \n\nThe guy has 5 reviews on realself. Do your research and you will find multiple claim of people claiming they have been not been operated by him or Maude Belanger. I personally know for a fact Bensimon does SRS. Yes the FFS doctor there. \n\nInstead of supporting each other. The community rather lie to each other to make themselves feel better. \n\nMy SRS was done 1 hour 36 minute and it looks like crap. I will not and will never recommend people to go to Montreal. \n\nLow quality SRS. Huge monopoly since they got pretty much ( some exceptions) all the surgeries in Canada and it’s covered in all provinces. ( big lobbying). \n\nI can’t speak for Phalo and stuff but as far as vagina’s???? \n\nWorst place... final...\nWhoever says the contrary.\n\nProve it. I know I’m trying too. Help me so that it’s mandatory to share to results.[Brassard results ](https://imgur.com/a/ikkMuyn?s=sms)",
      "score": 45,
      "created_utc": "2020-11-22T14:52:29Z"
    },
    {
      "id": "g2sbd2o",
      "author": "[deleted]",
      "body": "It’s so sad and frustrating. Almost all of us are broke and desperate, so as soon as the stars align, we rush to the only surgeon possible.",
      "score": 34,
      "created_utc": "2020-08-25T10:18:35Z"
    },
    {
      "id": "hoqrl6e",
      "author": "Ivanna_is_Musical",
      "body": "I was extremely mistreated  by dr Javier Belinky in Argentina. He belongs to the wpath but that isn't a guarantee of humanity or decency. He's very aggressive and will dismiss ANY complication you have,  even when they're usual ones, but belinky wil blame YOU for it. \n\nIt happens in every country. They're like a mafia. This needs to be talked more and more, we can't live being coerced and nothing is done to expose this business. I'm 6 weeks srs and my surgeon mistreated me in the worst ways (blaming on health, disobeying his guidelines, etc etc etc). I couldn't defend myself because they have such power and know we are vulnerable.  I'm facing complications and he blames to me for it, or doesn't answer my questions. Life It's a hell now and hope to recover well but I'm too weak to fight right now. I have recorded phonecalls with his aggressive words and accusations. \nThey know that blaming us for their bad praxis and unethic inhuman behavior is what works best. \n\nJust want to say that he maybe (not sure but possibly was him) sent to me a psychiatrist that to my surprise, was a gay guy...and they share lawyers and credibility. Exactly a mafia. The could make me go suicidal if they want, then blame my \"mental health x etc etc\"..\n\nThis needs to be exposed! I'm on tears for the girls and boys that have ruined lives after going to monsters of a surgeon!",
      "score": 23,
      "created_utc": "2021-12-16T04:54:31Z"
    },
    {
      "id": "g47324s",
      "author": "BotchedSRS",
      "body": "I got botcbed by Salgado. I can related. Sadly.  Somebody recently commented on my youtube channel where I talked about how bad my one encounter with Rumer went that Rumer is very talented and she is genuis. I was shocked people still go to her for surgeries. Wtf",
      "score": 19,
      "created_utc": "2020-09-06T02:52:24Z"
    },
    {
      "id": "hu3dla1",
      "author": "SuicideDoll1",
      "body": "Thank you for posting this and shedding light!!! Surgeons that work in transgender care need to be more held accountable when they don’t reach the patients needs. I feel that a lot of surgeons in trans care half ass the surgeries who are paid for by insurance which is ridiculous. I understand mistakes can happen but some surgeons have ghosted their patients after botching them once they got paid. For example Dr Ting",
      "score": 17,
      "created_utc": "2022-01-25T01:19:48Z"
    },
    {
      "id": "ghvq0t4",
      "author": "Elizabeth-The-Great",
      "body": "Oh my god, I can't read this. Thank you for sharing, I had to stop after the first few lines of the second paragraph.\n\n&#x200B;\n\nTrigger warning if you're not ready to read about this story. This is one of the things that scares me the most with surgeries such as this.",
      "score": 15,
      "created_utc": "2021-01-03T00:31:03Z"
    },
    {
      "id": "g25ra01",
      "author": "[deleted]",
      "body": "I'm surprised she was sitting so soon post op. I couldn't sit up in a chair for months",
      "score": 15,
      "created_utc": "2020-08-19T23:56:04Z"
    },
    {
      "id": "g50j798",
      "author": "[deleted]",
      "body": "[removed]",
      "score": 12,
      "created_utc": "2020-09-13T01:13:29Z"
    },
    {
      "id": "hhyonr0",
      "author": "kellanium",
      "body": "I made the mistake of going to her and now i'm looking to get a revision and i have no idea where to start.",
      "score": 11,
      "created_utc": "2021-10-25T08:16:56Z"
    },
    {
      "id": "i35o70x",
      "author": "Aszdeff",
      "body": "i'm light-headed after reading this",
      "score": 9,
      "created_utc": "2022-04-02T22:08:37Z"
    },
    {
      "id": "j61115m",
      "author": "nzgirl02",
      "body": "Traveling overseas for any surgery is a scary experience, even more so when the surgery is unavailable in ones own country.  \n\nAfter less than positive initial interactions with several Thai clinics I contacted IM Gender clinic in Spain and the response was efficient and professional, and before I agreed to anything I had a video consult with the surgeon who would actually perform the work, talked about my fears and needs, and agreed on the proceedure required. \n\nThe clinic experience itself was very good, all the staff caring and professional, and after care - both in Spain and by video/email since my return - undertaken by the surgeon herself, with all fears and questions attended to.  Now at 10 weeks, I am happy with the results, and slowly returning to my normally very physical life.\n\nWith the cost being comparable to the more popular Thai surgeons, IM Gender is well worth considering.\n\nJamieMarie",
      "score": 6,
      "created_utc": "2023-01-26T23:12:24Z"
    },
    {
      "id": "g36b4v9",
      "author": "El-canada-man",
      "body": "Holly smoke...",
      "score": 3,
      "created_utc": "2020-08-28T20:55:23Z"
    },
    {
      "id": "ir6zqt8",
      "author": "WeirdKiwi107",
      "body": "oh omg i know this situation all too well unfortunately with my own orchiectomy below last year i should have realized something was wrong when the surgeon was all to eager to say he could help me he helped me alright into 9 months of agonizing pain and a second surgery to fix what ever he did to me in the first surgery. it was not good now i fear moving forward with breast surgery and facial surgery cause i do not know what will happen to me in those additional surgeries in life?",
      "score": 7,
      "created_utc": "2022-10-05T20:03:58Z"
    },
    {
      "id": "g3high4",
      "author": "CasraTX",
      "body": "2 weeks after surgery, she was at a movie?  Uhm... what?",
      "score": 9,
      "created_utc": "2020-08-31T16:46:39Z"
    }
  ]
}