{
  "id": "1mocwd7",
  "title": "Sizing up dilator again after just a few days if all is well?",
  "author": "ShinAnnaGuns",
  "selftext": "I have seen the recommendation on this subreddit that, if comfortable on the current size of dilator, you can size up every 2 weeks. But if I adapted to the new size after just a few days, can it be more quickly than 2 weeks?\n\nI am at 10 weeks post-op, and my surgeon has cleared me for everything except weightlifting. So I've moved on from the straight glass dilators the surgeon provides, and sized up using Soul Source dilators. My current schedule looks like:\n\n3x daily: 10 minutes blue #2 (my previous largest size), 10 minutes green #3\n\nI bled a little on the first session with these. I think it was from the urethra. I suspect it was just insertion angle and being a bit clumsy, what with these dilators being a different design as well as size. I had literally no issues on the next dilation just 6 hours later.\n\nIt's been 3 days and it's just fine, I am quickly getting to full depth of just over 6\" with both dilators, so I am considering adding in the orange almost immediately. So the new scheuld would be:\n\n3x daily: 10 minutes of each of blue #2, green #3, orange #4\n\nThe reason I have a sense of urgency around it, is that I only have 2 weeks before I am back at work, and I'll be dropping to 2 sessions per day. I'd like to get used to the maximum size while I can take all the time I need in each dilation session, and still have 3 sessions per day to make good progress. I'm worried that if I wait until I am back at work and dropping the number of sessions, it's going to be tougher to add in the orange dilator.\n\nTL;DR is it ok to add in a new dilator size after just a few days, if all is well on the current size?",
  "score": 3,
  "url": "https://www.reddit.com/r/Transgender_Surgeries/comments/1mocwd7/sizing_up_dilator_again_after_just_a_few_days_if/",
  "num_comments": 1,
  "created_utc": "2025-08-12T16:08:32Z",
  "comments": [
    {
      "id": "n8biq6b",
      "author": "DanWago",
      "body": "The main thing is to listen to your body. Take it slow. Before sizing up I would keep the next size down dialator in for about 20 mins before attempting the next size up. Relax and breathe.",
      "score": 3,
      "created_utc": "2025-08-12T17:11:37Z"
    }
  ]
}