{
  "id": "1mnox98",
  "title": "Update: Bottom surgery regrets 4 weeks before surgery, please help",
  "author": "Weilgambit",
  "selftext": "So hey! This is me from the other day, maybe you saw my post the other day, maybe not. \n\nSo, my mom asked me if I wanted to keep my OG genitalia and if that’s why I was so nervous, that really stung. Eventually my dad came to visit and I talked about it with him, I had little time to make a choice so I said\n\nYes\n\nI feel weird now, how do you even know if you made the right choice? \n\nYou may call me stupid and I probably am but, there’s this friend who has always been great to me, even now in this crisis. She liked me, back in uni but I didn’t notice at first, then I played dumb cos I got scared. Throughout the years I think I have developed feelings for her and suddenly, some ideas have come to my mind.\n\n1) this isn’t about her, I will never tell her but about what my feelings reveal: I don’t see myself using my OG genitalia often but, maybe it wouldn’t be too bad, under the right circumstances\n\n2) What if I was scared of using it because I was scared of “being a man” by what society taught me, and not necessarily disliked it? I don’t see myself using it a lot but I wonder, if it couldn’t have been too bad? \n\n3) Fear of closing the door on an unique way of being, like this, despite of the suffering it had brought me, perhaps I was seeing it wrong? And I know I shouldn’t make decisions based on x or y hypothetical people liking me in the future but, the death of the possibilities worries me. The death of so many WHAT IFs\n\n4) If I don’t do the surgery now I feel like I’m not advancing at all, we been waiting for this for half a year already, I would feel stuck. And I’m already 23 next week, I would like to live some of my 20s the way I wanna live, if that’s with a vagina. This was a BIG part of why I made my decision, as to not waste time \n\nAnyway, I’m sorry for my rambling. If anyone has had such worries before I would appreciate any input, the choice is made, maybe if I hurry I could change it but probably not, this is probably my first and last update \n\nThank you 💜\n\n\n\n\n\n",
  "score": 10,
  "url": "https://www.reddit.com/r/Transgender_Surgeries/comments/1mnox98/update_bottom_surgery_regrets_4_weeks_before/",
  "num_comments": 13,
  "created_utc": "2025-08-11T20:55:54Z",
  "comments": [
    {
      "id": "n87t179",
      "author": "h3llo_ever",
      "body": "I don’t think you should proceed with surgery if you’re having this many questions and doubts. Surgery will always be an option, your original genitalia will not be. Give yourself more time to really consider this. Once it’s done, it’s done. It will never be the same afterwards.",
      "score": 42,
      "created_utc": "2025-08-12T01:47:17Z"
    },
    {
      "id": "n87x68q",
      "author": "MotorSuccotash1825",
      "body": "If you are having doubts do NOT go through with it…..wait another year if you still feel off about it, then it’s not for you",
      "score": 16,
      "created_utc": "2025-08-12T02:12:09Z"
    },
    {
      "id": "n86z5b0",
      "author": "IntoTheMusic",
      "body": "I can't really relate to this specific experience, but I thought I could maybe help with something I do when I'm being indecisive. Complete the sentence with one word:\n\n\"If I canceled my surgery, I would be ________.\"",
      "score": 17,
      "created_utc": "2025-08-11T22:50:50Z"
    },
    {
      "id": "n88h52x",
      "author": "vortexofchaos",
      "body": "This is *your* transition, based *entirely* on *your* needs, desires, safety, and comfort levels. It’s *normal* to have concerns and questions before life-changing surgery like this. As a parent, I know your parents are concerned, but they can’t understand the dysphoria you feel. Cis people simply have no reference points to understand what it means to be transgender. I hope that you have a good therapist, preferably someone with experience in gender and LGBTQ issues, a professional neutral party who can help you figure out just what you want and need. This is the time to talk with them.\n\nThis surgery is a leap of faith. You’re very young, so you may not have had any decisions to make like this before. There are many points in life where you just can’t know how something is going to turn out. You go into these situations with the hope that they will turn out well, that they will bring you the peace and happiness you desire and deserve, but you can’t know beforehand. This is *your* choice. It’s not your father’s choice, it’s not your mother’s choice, it’s not some possible friend from uni’s choice, and it’s certainly not some nebulous concept of society’s choice. This is *entirely* about what *you* think is best for *you*. You’re an adult, and part of being an adult is listening to yourself and no one else, to make the choice that’s right for *you*.\n\nI can’t tell you what the right choice is for you. \n\nI can tell you that I had many of the same questions as you, at 66 years old. This was major surgery with higher risks because of my age and medical issues. I had my GCS in December. As I was recovering, I had the simple, powerful, profound revelation that I *KNOW* I’m *finally* in the *right* body. My dysphoria is GONE. \n\nI can’t tell you that you’ll have the same revelation.\n\nYou’re young, hopefully with a long, joyful life ahead of you. You already have a pretty good idea of who and what you are. You have the opportunity waiting for you to have this life-changing surgery, but you also have time to reflect and figure out what’s best for you. \n\nIt is all too easy to let our fears and anxieties grow all out of proportion to the eventual result, especially in cases like this. Far too often, the things we regret in life are the choices where we didn’t take that leap of faith, when we played it safe, or let others tell us what they thought best for us even as we thought differently.\n\nThis is *entirely* your call. No one can possibly know what will happen, regardless of *your* decision. Only *you* can know what’s right for *you*. Given that, without any other opinions, what’s *your* heart and mind telling *you?* 🫂👭💜\n\n67, 3+ years in transition, fully out almost the entire time, now rocking my Christmas vagina!, living an amazing life as the incredible woman I was *always* meant to be! 🎉🎊🙋‍♀️✨💜🔥",
      "score": 5,
      "created_utc": "2025-08-12T04:27:16Z"
    },
    {
      "id": "n8826nd",
      "author": "Spirited_Stick_5093",
      "body": "I think so much of transitioning these days is the fear of losing access to these procedures and feeling pressured into doing them as soon as possible, but I agree with what others said. You can always reschedule, but you can't undo. Better to really dwell on it and go forward with confidence.",
      "score": 5,
      "created_utc": "2025-08-12T02:43:33Z"
    },
    {
      "id": "n890cbt",
      "author": "Mysterious_Code4291",
      "body": "Not wasting time is a logical but definitely not the right incentive to have such a major surgery. You have all the time in the world. I had surgery at 27 and still have a whole life with a vagina ahead of me. So will you! No matter if you do it now or in ten years.\n\nMaybe try and use your current genitalia. See how it makes you feel when you’re with someone you like.\n\nThe only reason to get the surgery, in my opinion, is if you need the surgery to continue with your life (and all that’s part of that: like romance, etc)",
      "score": 3,
      "created_utc": "2025-08-12T07:16:58Z"
    },
    {
      "id": "n872foc",
      "author": "HiddenStill",
      "body": "For some people I don’t think there’s any way of knowing for sure until afterwards. It’s not like you have any experience with it to go on. There are people who regret it, but it’s a small number and most are those who get botched.\n\nI know someone who cancelled their surgery the morning it was to happen, and regretted cancelling by the afternoon. It was another year until she could get surgery, plus I think she ended up paying twice. That was related to fear and talking to someone close to her who made those fears worse.",
      "score": 3,
      "created_utc": "2025-08-11T23:09:46Z"
    },
    {
      "id": "n88o6b9",
      "author": "transguy369",
      "body": " I would discuss your concerns with your surgical team. Ask if many people have these concerns and what they typically recommend or do. Idk, but hugs friend. You can always show up and change your mind- if you're not totally decided and dont want to cancel and lose your spot. They cant force you to get surgery. Only concern would possible be paying a fee for services not rendered but it sounds unethical in this situation",
      "score": 1,
      "created_utc": "2025-08-12T05:24:40Z"
    },
    {
      "id": "n8blt4d",
      "author": "TvManiac5",
      "body": "I think you should try and reframe your questions. Instead of asking \"what if I regret this\" ask \"what if everything goes well\". \n\nWhat I'm saying is none of these questions sound like \"I actually want/am fine with my penis\". Moreso, they sound like bargaining. Trying to convince yourself it's not that bad because you don't feel you deserve a vagina. \n\nI'm saying this because of what you said in your first post. That you feel like having a vagina would add pressure of having to fit a spesific idea of being a woman that you don't feel you have earned. That it would essentially remove the shield of being a \"work in progress\" woman so to speak. \n\nSo that is why I'm proposing the reframing. Suppose everything goes well, without any complications or issues and you have a functioning and normal looking vagina. Would you internally be happy with that? And externally? \n\nAnd if not what exactly would the issues you feel you would have be? \n\nWhat exactly are you worried about?",
      "score": 1,
      "created_utc": "2025-08-12T17:26:46Z"
    },
    {
      "id": "n8bnugp",
      "author": "NothingButSunnySkye",
      "body": "Nerves, fear, self-doubt, all seem to be common before surgery.  Myself, as well as quite a few other post op trans women have all had similar fears…. Surgery is a BIG thing! I recommend talking to your counselor in depth, and listening to your self, deep down inside as to what you truly want. You can cancel very close to the surgery if I am not mistaken, give it a few more weeks. As you get closer, you may find more clarity and confidence. That’s just my two cents worth, I was terrified and had a bunch of self doubt a few weeks out, but I soul searched a bit more and talked to my counselor and people close to me and a week before it all changed, I was excited and became more so right up until the morning of, then I was terrified a bit again but because… major surgery. When I woke up a few hours later, I’ve never felt more “normal” and happier in my life. I am 8+ weeks post op, finally getting back to my life and feeling amazing. For me the doubt was kind of a “panic dysphoria” and a bit of imposter syndrome feelings, all justified from the echos of a voice in my own mind that kept me imprisoned most of my life. I’m 51, it’s never too late, but I also regret all the precious time I’ve missed not truly living, so I thought I’d share. Either way, in the end, always let it be YOUR choice.",
      "score": 1,
      "created_utc": "2025-08-12T17:36:47Z"
    },
    {
      "id": "n87tqgb",
      "author": "Weilgambit",
      "body": "You may be right, I’m just scared of waiting more i guess. And Thanks",
      "score": 3,
      "created_utc": "2025-08-12T01:51:28Z"
    },
    {
      "id": "n8bkdma",
      "author": "SarahXtal",
      "body": "Before my surgery I had some slight doubts and \"what if\"'s spinning in my head. At that time I'm not 100% sure I could've finished that sentence. Not until the day before my originally scheduled surgery. I received a call from my surgeon's office that my surgery has been cancelled. One of the lead surgeons was out sick (I had PPT and there were two surgical teams) and it was rescheduled for a month later. It hit me soo hard that I just broke down sobbing on the phone, couldn't even finish the conversation and hung up. This completely solidified my determination to get this surgery. \n\nSo to OP I'll just say, imagine you get this call. How would it make you feel?",
      "score": 2,
      "created_utc": "2025-08-12T17:19:45Z"
    },
    {
      "id": "n8bp01m",
      "author": "NothingButSunnySkye",
      "body": "This sums it up perfectly! Had similar scheduling issues with pushed back date, not quite as severe as day before tho, I can empathize!",
      "score": 1,
      "created_utc": "2025-08-12T17:42:30Z"
    }
  ]
}