{
  "id": "1mobutx",
  "title": "Surgery recovery advice?",
  "author": "mkw92101",
  "selftext": "I know there’s a million of these posts already but I have ffs on 8/22 (yay!) and I’m starting to get very anxious. I live in dc and surgery is here at GW so that only adds to the anxiety because of everything going on here currently. Anyway, I wanted to see if yall can offer any things I might need after surgery. I’m having jaw, chin, brow bone, and trach shave so any tips you have specifically related to these surgeries is greatly appreciated 💕 I have 2 dear friends flying in from Portland coming to take care of me for 5 days after and then I’ll have people checking in on me after. Thanks in advance! ",
  "score": 2,
  "url": "https://www.reddit.com/r/Transgender_Surgeries/comments/1mobutx/surgery_recovery_advice/",
  "num_comments": 5,
  "created_utc": "2025-08-12T15:29:41Z",
  "comments": [
    {
      "id": "n8bh5xi",
      "author": "jackiejuicey",
      "body": "hi hi! i just had my ffs on 8/7 (last thursday) so i have some fresh advice for you. you’re going to do great! here’s what i recommend:\n\n1. order some face ice packs from amazon that you can have ready in the freezer once you’re ready to use them. these are a godsend! i suggest ordering two so you can always have one ready to use. \n2. please, try your hardest not to drink a lot of water after surgery. your surgery team will tell you only to take small sips because of the risk of vomiting, but you’re going to be SO thirsty and want to drink the whole cup 😭 which is what I did! this resulted in me vomiting a ton which made the already large pain worse. if you can bear it, only take tiny sips of water, and avoid drinking anything else other than water if you start vomiting like i did. \n3. get pre made smoothies (trader joe’s), soups, and drinkable yogurts that you can have on deck. ensures are good, anything you can drink easily! the liquid diet sucks but you get used to it fast. \n4. for the trach shave, you’ll be on vocal rest so be prepared with a white board that you can write on to communicate with your friends. this was really helpful! \n5. the swelling will be wild. it will be case specific and you never know when it will peak (mine did around 48 hours) but it will not be like that forever, so just stay positive! \n6. write yourself some affirmations for post surgery. this helped me get through the first couple days :) cringe but true \n\nthat’s it from me - you are gong to do amazing ♡ best of luck !",
      "score": 3,
      "created_utc": "2025-08-12T17:03:53Z"
    },
    {
      "id": "n8bhfr8",
      "author": "TransMontani",
      "body": "The stitches in your mouth make it an absolute necessity that you be on a soft diet early on. Nutrition shakes, yogurt, pudding cups, and soups are all your friends. Stock those before your surgery. \n\nHave an upright bed pillow handy for attempting to sleep. Wear your jaw bra religiously.",
      "score": 2,
      "created_utc": "2025-08-12T17:05:16Z"
    },
    {
      "id": "n8br7qm",
      "author": "mkw92101",
      "body": "Thank you SO much! This is all so helpful! I do have some follow up questions.\n\n1.) I know you probably aren’t on soft foods yet but any suggestions for this? \n\n2.) how long is vocal rest after trach shave? I don’t remember my doc mentioning a timeline..",
      "score": 1,
      "created_utc": "2025-08-12T17:53:15Z"
    },
    {
      "id": "n8brnmk",
      "author": "mkw92101",
      "body": "Sorry! Also, any advice with washing the hair after?",
      "score": 1,
      "created_utc": "2025-08-12T17:55:22Z"
    },
    {
      "id": "n8braml",
      "author": "mkw92101",
      "body": "Thank you thank you! 💕",
      "score": 2,
      "created_utc": "2025-08-12T17:53:38Z"
    }
  ]
}