{
  "id": "1mo1ay6",
  "title": "1 month in a few days.",
  "author": "Niknax21",
  "selftext": "I’ll be one month post op srs on Friday Aug 15th. (Which I’ll update on, but this is kind of a list of things to discuss and update the surgeon.)\nI’m past the panicking stage, and now in a more “my body is doing what it’s gonna do, and I’ll wait for the surgeon to tell me what that is,” stage. \nWound separation is healing (and quite tender and painful) \nWith dilation, I have mainly been using just the purple soul source. I’ve attempted to use the blue, and I can get it in, but still experiencing intense discomfort and noticeable back steps in healing for a day or two after trying. So purple it is. \nI started with 3.5 dots, I am now struggling to maintain 2 dots. When my legs are together, my majora kind of hug the 4th dot, but the 3rd dot is clearly visible no matter how much I push, twist, and breath in and out. \nTonight, I tried using a slim vibrator to open me up first, and I think it worked. I find I got to the second dot depth faster and with less pain. I might mark the equal distance on the vibrator, and start doing that regularly.\nI’m also contemplating, doing my dilations every 4 hours as opposed to 6, because my pelvic floor feels like it is really fighting me, and 6 hrs seems to be enough to snap back shut. \nI’m assuming my canal is fine, but today I did get this burning sensation across the top of it during insertion and pull out. So maybe granulation tissue? \nThere is also a fishy odor, that I am 100% not a fan of and trying to figure out how to get rid of that permanently. \nI am also struggling with initiating urination. I will have the urge to go, but unless my bladder is really full, nothing will happen. So I’m peeing 2-3 times a day (my normal before was 6-9x). Working on upping my fluids, because it does feel kind of like I have the early signs of a uti. I am also using actual water to rinse after I pee, rather than just wiping/patting dry. ",
  "score": 5,
  "url": "https://www.reddit.com/r/Transgender_Surgeries/comments/1mo1ay6/1_month_in_a_few_days/",
  "num_comments": 0,
  "created_utc": "2025-08-12T06:32:07Z",
  "comments": []
}