{
  "id": "1ik1o02",
  "title": "The future of this sub",
  "author": "HiddenStill",
  "selftext": "After this sub was \"accidentally\" banned 2 days ago there's been a lot of discussion about the future of the sub.\n\nWhether it was an accident to not, the possibility exists that this sub and others will be banned from reddit in the near future. In the event that happens what do we do?\n\nI started as a mod here when the sub had only 3k members and my intention was to grow it to where it is today, and more. I last [wrote](https://www.reddit.com/r/Transgender_Surgeries/comments/zbfm0d/moderation_on_this_sub_2022/) about how the sub is moderated in 2022.\n\nIn principle, it would be better to have an trans resource site independent of reddit and corporate control. In practice its very difficult to achieve for a number of reasons\n\nThere's no point in moving to another site like Discord which is susceptible to the same risks as reddit. i.e. based in the USA. But what other sites are there, and where else is safe in the long run? Not just safe from hostile governments, but whoever runs the community losing interest, or data (susans.org lost years of it with a hard drive crash), selling out, etc.\n\nNeither Discord and Facebook are indexed by search engines making it difficult for people to discover the resources in the first place, or finding information once you're there. It's like a black hole for knowledge; you put it in and it disappears. Personally, I'd never waste my time on building this kind of community on sites like that.\n\nReddit also provides, or did, legal protection. If a surgeon doesn't like what's posted here they can't easily censor it. And especially important, they can't attack me personally as its not my responsibility. Good luck going after reddit corporate.\n\nAs one of the largest social media sites in the world reddit makes it easy to build community, there's so many of us already here. People have mentioned sites like Lemmy as alternatives, but as far as I can tell they have tiny membership and few people have even heard of them.\n\nA major advantage for me was reddit's wiki's. Few subs take advantage of them, but I believe its a great way to build and spread knowledge, and it has helped build this sub and raise the general level of knowledge. People have asked that it be copied off site, but if this sub disappears many of the links in the wiki will also disappear. Its not nearly so useful at that point. I don't think anyone else will build or maintain a wiki either, as it seems to interest very few people.\n\nRegardless if reddit banning this sub or not, I'd like to see another site even better than this one, but I'm not sure its possible. Even more so while reddit hosts trans content as 99% of people will just come here anyway. Reddit basically killed old style forums years ago and nothing's changed since then.\n\nIt's even more difficult to build a trans surgery surgery community on another site while this sub exists because its so big and useful that almost no one would bother going there. And I'm not shutting the sub down to force everyone to move to another site. That would cause immediate harm to people who use the sub.\n\nIf this sub does get shut down I personally won't be trying to rebuild elsewhere. I'm burned out with this and don't have the energy.\n\nIf anyone wants to discuss how to build a successful trans surgery community I'm willing to offer my advice. I'd like to see it happen and it would be great if people had a place to go, and knew about it ahead of time. My main aim is to help people, and it doesn't matter to me where that comes from.\n\n*****\n**Edit**\n\nIf you set up any external resources for surgery, hrt, etc please add them in the comments here. And I suggest people save the links in case this sub, or worse, all trans content on reddit disappears.\n\nThere’s a number of people talking about off site projects they are considering or actually doing. Persons you could get together and discuss if you could work together.\n\nThis looks interesting r/RedditAlternatives\n\nThere's some cisgender people wanting to comment here in support of Lemmy and other reddit alternatives. Rule 5 limits cis people on this sub, but I'll allow it on this post only and give them a flair \"cisgender reddit alternatives\". If you're one of them please don't comment elsewhere.\n\nOther reddit posts\n\n* https://www.reddit.com/r/lgbt/comments/1ii61jm/so_transgender_surgeries_subreddit_just_got_nuked\n* https://www.reddit.com/r/MtF/comments/1ii6qfw/rtransgender_surgeries_was_banned_an_hour_ago\n* https://www.reddit.com/r/germantrans/comments/1ii6y7y/reddit_purge_beginnt_voran_transgender_surgeries\n\nMedia\n\n* 2025-02-05 - https://www.newsweek.com/transgender-surgery-subreddit-disappearing-bug-2026965 by Rachel Dobkin \n* 2025-02-06 - https://www.engadget.com/social-media/reddit-blames-bug-after-banning-more-than-90-nsfw-subreddits-221908069.html by Karissa Bell -- *\"The nature of the affected subreddits has alarmed some users and moderators who worry the company may be getting ready for a bigger crackdown. In r/transgender_surgeries, where users discuss their medical care, members began to discuss ways to “back up” the content of the subreddit. \"\"*\n\n*****\n**Lemmy Discussion**\n\nLemmy keeps getting mentioned. I don't know much about it yet. Its pitched as [Fediverse](https://en.wikipedia.org/wiki/Fediverse) reddit replacement.\n\nAccording to the statistics [here](https://fedidb.org/software/lemmy) Lemmy has 477,049 total users and 45,194 monthly active users. The trans instance https://lemmy.blahaj.zone has 8671 total users and 971 monthly active users.\n\nThis sub alone has 93,419 members, and in the last 30 days 4.6M views, an average of 20.2k daily unique visits, 4.0 subscribed, and 1.2k unsubscribed. The main FTM surgery subs in total have about that again, and the HRT subs are a bit larger in total.\n\nThis sub is then 10 times the size of the main trans Lemmy instance, and the total with the subs I mentioned is approaching the entire size of Lemmy. This doesn't include all the very main trans subs which are individually many times larger as I only included the important medical subs.\n\nI have a few reservations about Lemmy, partly because I know so little at this point\n\n* Can Lemmy can scale to the size required if trans content was banned on reddit.\n\n* I couldn't find much information on Lemmy's moderation tools. Currently this sub attracts a lot of hate and chasers, which moderation easily takes care of. In the past the have been excessive amounts, but reddit has cracked down on it, and provides tools to limit it (not very good ones). Lemmy would be unusable without this.\n\n* Lemmy works by sharing data across multiple instances (computers) and it appears there seem to be privacy concerns about the amount of data on users that is shared.\n\n* What is to stop the owners of the instance shutting it down, or the data being lost for any other reason? Although not a corporate it makes no difference. There would be a massive loss of knowledge and history.\n\nIf anyone has expert knowledge on Lemmy I'd be interested in learning more.\n\nThe author of the Engadget article on the sub's ban made a YouTube video on the Fediverse\n\n* [The future of decentralized social media](https://www.youtube.com/watch?v=TXsr8zRsObw) by Engadget (Karissa Bell)\n\n\nDiscussion on Lemmy\n\n* https://lemmy.blahaj.zone/post/21815813\n* https://mlmym.lemmy.blahaj.zone/post/21815813 if you like old reddit",
  "score": 396,
  "url": "https://www.reddit.com/r/Transgender_Surgeries/comments/1ik1o02/the_future_of_this_sub/",
  "num_comments": 86,
  "created_utc": "2025-02-07T18:17:14Z",
  "comments": [
    {
      "id": "mbirmp8",
      "author": "Superchupu",
      "body": "i'd recommend to self host a wiki, to have alongside the sub. look at how the minecraft wiki did it (to get away from corporate websites). and if the subreddit goes down the wiki could be an easy place to announce new places to go to",
      "score": 140,
      "created_utc": "2025-02-07T18:31:03Z"
    },
    {
      "id": "mbitpbv",
      "author": "Adventurous-Serve-64",
      "body": "I'm a trans/queer web developer and I run a business focused on making websites for the queer community. I own the domain queer.exchange and I would be happy to help with this. I'm recovering from FFS at the moment so I have a little extra time on my hands. But I would definitely want help and do not want to be responsible for moderation.",
      "score": 86,
      "created_utc": "2025-02-07T18:40:50Z"
    },
    {
      "id": "mbiulj8",
      "author": "[deleted]",
      "body": "[deleted]",
      "score": 39,
      "created_utc": "2025-02-07T18:45:03Z"
    },
    {
      "id": "mbja3ua",
      "author": "NatMyIdea",
      "body": "I detest how Reddit suffocated out old-school forums. We wouldn't be worrying about a valuable resource being subject to the whims of a larger organization if we still used forums.\n\nWell, technically we could still create a vBulletin site or something (the tools still exist), but I guess exposure and financing would still be an obstacle. And it could still vanish in an instant. Maybe something like Lemmy really is our best bet since it's a fediverse platform.",
      "score": 21,
      "created_utc": "2025-02-07T19:59:02Z"
    },
    {
      "id": "mbjnsl3",
      "author": "Own_Guitar_5532",
      "body": "We have started a wiki project for transgender surgeries! I did some coding yesterday, we will try our best to get all the information preserved ✨",
      "score": 22,
      "created_utc": "2025-02-07T21:04:57Z"
    },
    {
      "id": "mbjbpyr",
      "author": "CuriousTechieElf",
      "body": "I think your reasoning makes a lot of sense. Pre-emptively moving off Reddit, just in case the sub gets permanently shut down in the future doesn't make sense.\n\nWhat might still make sense though is some kind of backup of the data that just exists offline in some politically safe and fault tolerant location. That would be lower effort to maintain than a complete self hosted alternative.\n\nAlso, it seems like it would be doable to not just back up the wiki but also the reddit articles linked to.",
      "score": 10,
      "created_utc": "2025-02-07T20:06:51Z"
    },
    {
      "id": "mbiyohl",
      "author": "millybeth",
      "body": "RIP Trueselves.",
      "score": 9,
      "created_utc": "2025-02-07T19:04:20Z"
    },
    {
      "id": "mblso2n",
      "author": "Recent-Classroom-704",
      "body": "Thank you for your efforts. I had multiple surgeries over the years and this sub has been a huge resource, thank you",
      "score": 10,
      "created_utc": "2025-02-08T04:06:40Z"
    },
    {
      "id": "mbj1gr4",
      "author": "Crispy95",
      "body": "Fwiw, I have no technical skills but skim most of the new content on this sub twice a day. \n\nThis sub has been a significant resource for me and I'm happy to put my hand up for content moderation here or another site. I used to moderate a gaming sub for a while. \n\nEven happy for wiki maintainence - I played a bit with wiki modding back in the day. \n\nI won't be any use with getting us on another site, but let me know if you need extra hands.",
      "score": 7,
      "created_utc": "2025-02-07T19:17:40Z"
    },
    {
      "id": "mbk6x5x",
      "author": "lauren_knows",
      "body": "Any platform that acts as a substitute is going to feel like a downgrade because of the built-in community that Reddit or Facebook or Discord has. ***But that should not stop us from creating one.***\n\nPersonally, I feel like a platform like Discourse is easy to deploy and has a lot of the same features as a subreddit. They have a mobile app, and lots of moderation options. We could also try to mirror posts from Reddit to Discourse, to keep them in sync. I could have an instance up in an hour, and we could test it as a community. But the transition (see what I did there?) would be hard.",
      "score": 8,
      "created_utc": "2025-02-07T22:38:20Z"
    },
    {
      "id": "mbmfqpb",
      "author": "ZachAttack6089",
      "body": "> People have asked that it be copied off site\n\nGonna share the backup I made again:\n\n- GitHub: https://github.com/zp100/Transgender_Surgeries\n- Live site: https://transgender-surgeries.vercel.app\n\nUnfortunately these are both controlled by third parties (Microsoft and Vercel respectively), but the GitHub link has instructions for self-hosting your own version. You can also download the wiki pages so that you have a copy in case both of those links are taken down, and can view it by opening the pages with a tool that can render markdown (such as Visual Studio Code, or your own GitHub repository).\n\nIf many people have it copied/hosted on their own devices, it'll be robust against individual failures or legal takedowns.\n\nIt's still missing some features (backed-up copies of Reddit links, places for discussion, etc.), but it has everything from this subreddit's wiki, and those features could be added in the future since it's a full-scale website. My main goal was to back up the wiki, because that seemed important to a lot of people, so at the moment I'm not planning to keep working on it. But if people seem interested in it then I could be persuaded to keep adding to it. :3",
      "score": 7,
      "created_utc": "2025-02-08T07:07:58Z"
    },
    {
      "id": "mbmtp7s",
      "author": "Le7emesens",
      "body": "There are enough technologies and social networks to build and publish.\nIt's just a matter of time, resources, commitment and perhaps money.\nSo that's not the real issue to worry about. So let's put technicalities and  technology aside for a minute.\n\nWhen you are subject to the whims of an organization, there are only 2 critical issues to worry:\n1) Backing up and saving the knowledge and information so they can be republished later under a new tech stack.\n\n2) And most importantly, preserve communication means with your community in case of unexpected shutdown. How to you achieve this?\nI'd suggest posting and pinning the list of all possible contact information (email address, wiki, Facebook gps, IG, X, Snapchat, etc) and if you can, create your own website that lists all these contact info.\nIf these accounts don't exist, it would be wise to start creating them today. E g., transgender_surgeries_mod(at) gmail.com etc. You get the idea?\nSo that if you get shutdown tomorrow, we all have a way to find you, gather, organize ourselves and help you rebuild...",
      "score": 6,
      "created_utc": "2025-02-08T09:24:34Z"
    },
    {
      "id": "mc35gsd",
      "author": "BlazeAlt",
      "body": "Copy pasting from another user which has a new account so probably caught by auto mod\n\nI don't claim to have \"expert knowledge\" on Lemmy, but I was discussing the topic there with one of the users of this sub (hi bayesianbandit!), and I've been in Lemmy for long enough (2021) to know a few things about it.\n\n>Can Lemmy can scale to the size required if trans content was banned on reddit.\n\nLemmy *as a network* can scale indefinitely. Even if a specific instance is reaching its limit, people can create new instances to split the load. \n\nSo the problem is mostly if the \"transgender surgeries instance\" would be able to handle the load, and how much it would cost. Accordingly to data, \"the 10 biggest Lemmy servers still only have hosting costs of $50-$300/mo\".\n\n>I couldn't find much information on Lemmy's moderation tools. Currently this sub attracts a lot of hate and chasers, which moderation easily takes care of. In the past the have been excessive amounts, but reddit has cracked down on it, and provides tools to limit it (not very good ones). Lemmy would be unusable without this.\n\nThe official mod tools are awful and only suited for small communities. However larger instances developed a few third party mod tools to alleviate the burden, including an AutoMod of sorts. \n\nLemmy also allows something called \"defederation\", where users from one instance cannot interact with users from another instance. The nearest of that in Reddit would be if you were able to prevent *all* users who posted in a subreddit to post in yours. That helps wonders to keep haters at bay.\n\n>Lemmy works by sharing data across multiple instances (computers) and it appears there seem to be privacy concerns about the amount of data on users that is shared. / What is to stop the owners of the instance shutting it down, or the data being lost for any other reason? Although not a corporate it makes no difference. There would be a massive loss of knowledge and history.\n\nThe main concern is that data shared with one instance pops up in other instances, due to the federation. That's both a liability and a feature - because if the original instance goes down, the data is still preserved in the other instances.",
      "score": 6,
      "created_utc": "2025-02-10T22:44:04Z"
    },
    {
      "id": "mbkbfew",
      "author": "[deleted]",
      "body": "[deleted]",
      "score": 6,
      "created_utc": "2025-02-07T23:01:49Z"
    },
    {
      "id": "mc330ur",
      "author": "lvxferre-from-lemmy",
      "body": "My reply got caught in some filter because of a link, so I'll resubmit this with a different link. Sorry for the clutter ;_;\n\nI don't claim to have \"expert knowledge\" on Lemmy, but I was discussing the topic there with one of the users of this sub (hi bayesianbandit!), and I've been in Lemmy for long enough (2021) to know a few things about it.\n\n>Can Lemmy can scale to the size required if trans content was banned on reddit.\n\nLemmy *as a network* can scale indefinitely. Even if a specific instance is reaching its limit, people can create new instances to split the load. \n\nSo the problem is mostly if the \"transgender surgeries instance\" would be able to handle the load, and how much it would cost. Apparently [\"the 10 biggest Lemmy servers still only have hosting costs of $50-$300/mo\"](https://lemmy.zip/post/88530/205136).\n\n>I couldn't find much information on Lemmy's moderation tools. Currently this sub attracts a lot of hate and chasers, which moderation easily takes care of. In the past the have been excessive amounts, but reddit has cracked down on it, and provides tools to limit it (not very good ones). Lemmy would be unusable without this.\n\nThe official mod tools are awful and only suited for small communities. However larger instances developed a few third party mod tools to alleviate the burden, including an AutoMod of sorts. \n\nLemmy also allows something called \"defederation\", where users from one instance cannot interact with users from another instance. The nearest of that in Reddit would be if you were able to prevent *all* users who posted in a subreddit to post in yours. That helps wonders to keep haters at bay.\n\n>Lemmy works by sharing data across multiple instances (computers) and it appears there seem to be privacy concerns about the amount of data on users that is shared. / What is to stop the owners of the instance shutting it down, or the data being lost for any other reason? Although not a corporate it makes no difference. There would be a massive loss of knowledge and history.\n\nThe main concern is that data shared with one instance pops up in other instances, due to the federation. That's both a liability and a feature - because if the original instance goes down, the data is still preserved in the other instances.",
      "score": 5,
      "created_utc": "2025-02-10T22:24:17Z"
    },
    {
      "id": "mbjdhbu",
      "author": "Quat-fro",
      "body": "This sub has been the greatest thing for the community. It must be protected somehow!\n\nI've yet to get any major surgery but it's this place where I've discovered the do's and don't's and where best to go to suit my needs, without it I'd most certainly struggle to find out as much as I have and any decisions made would likely be ill informed.\n\nI can't help in any constructive way, I'm more a blacksmith than web developer, but whatever happens you definitely have my support to protect this important resource. x",
      "score": 7,
      "created_utc": "2025-02-07T20:15:25Z"
    },
    {
      "id": "mbk1vpc",
      "author": "Serenity_by_Willow",
      "body": "May be able to setup a anonymous hosted server in the Philippines or some such, away from nonsense \n\nA bulletin board?",
      "score": 3,
      "created_utc": "2025-02-07T22:12:43Z"
    },
    {
      "id": "mbvnji6",
      "author": "Secret300",
      "body": "I'd highly recommend hosting your own Lemmy instance or joining one. Lemmy is self hosted and open source and will give you a very similar experience to reddit without all the bullshit of reddit.",
      "score": 3,
      "created_utc": "2025-02-09T18:33:48Z"
    },
    {
      "id": "mbvrf6m",
      "author": "Secret300",
      "body": "Wanted to share the post on Lemmy. \n\nhttps://lemmy.dbzer0.com/post/37327351",
      "score": 3,
      "created_utc": "2025-02-09T18:51:42Z"
    },
    {
      "id": "mc43ri8",
      "author": "PuddingFeeling907",
      "body": ">* Can Lemmy can scale to the size required if trans content was banned on reddit.\n\nYes, because more servers can be added. You can upgrade the hardware to hold the new users.\n\n>* I couldn't find much information on Lemmy's moderation tools. Currently this sub attracts a lot of hate and chasers, which moderation easily takes care of. In the past the have been excessive amounts, but reddit has cracked down on it, and provides tools to limit it (not very good ones). Lemmy would be unusable without this.\n\nI would suggest using the frontend tesseract from [Blahaj.zone](https://tes.lemmy.blahaj.zone/) as that has the troll buster tool where you can ban the same malicious users from all the communities you moderate and you can keep track of when they were last online. Lemmy also gives the moderator the ability to check the downvoters. Voyager is a great tool for moderating on the go! You can read up on the official [documentation for moderating.\n](https://join-lemmy.org/docs/users/04-moderation.html) !lemmyapps@lemmy.world also has a lot of information on mod tools.\n>Lemmy works by sharing data across multiple instances (computers) and it appears there seem to be privacy concerns about the amount of data on users that is shared.\n\nYou can use the purge tool if you're an admin to completely wipe out content. Also there is a bug where moderator actions do not properly sync across instances so its best to use an local account from the same instance the community is hosted on.\n\n>What is to stop the owners of the instance shutting it down, or the data being lost for any other reason? Although not a corporate it makes no difference. There would be a massive loss of knowledge and history.\n\nFind your trusted instances then check up on their status updates every few months to keep tabs on their funding. Also you can use the communities: !fedilore@lemmy.ca and !yepowertrippinbastards@lemmy,dbzer0.com to see which direction the admins and moderators are heading in with their recent decisions. It's much more transparent with having public modlogs.",
      "score": 3,
      "created_utc": "2025-02-11T02:17:16Z"
    }
  ]
}