{
  "id": "1mnqke9",
  "title": "best srs surgeons in canada? is it even worth getting it done here?",
  "author": "Ok-Kangaroo-3544",
  "selftext": "i'm getting to a point where i'm really desperate for srs. canadian girls, who did you go to? the only established clinic i know of is grs montreal and they seem hit-or-miss, i guess the same can be said for any practice though.",
  "score": 9,
  "url": "https://www.reddit.com/r/Transgender_Surgeries/comments/1mnqke9/best_srs_surgeons_in_canada_is_it_even_worth/",
  "num_comments": 25,
  "created_utc": "2025-08-11T21:59:10Z",
  "comments": [
    {
      "id": "n86wiwt",
      "author": "FlyingBread92",
      "body": "Myself as well as most of my friends went to GRS Montreal and we're all happy with the results. They're very consistent. Aesthetic wise I think mine looks fine. Not a designer coochie out of Thailand, but it looks like a vag and I haven't had anyone who's seen it mention any weirdness. They've got by far the best and most extensive track record in Canada due to being around the longest. If you're paying out of pocket and really care about aesthetics you can probably do better abroad, but if you're looking for function and cost effectiveness they're tough to beat. I have enough means for a single surgery, so I decided to go with GRS so I could do FFS out of pocket instead. \n\n  \nIf you're interested, I did a big write up about my experience with them a few months back. Pictures suck since I was only around 6 months post-op at the time, she looks a lot better now at one year.",
      "score": 15,
      "created_utc": "2025-08-11T22:35:48Z"
    },
    {
      "id": "n87d544",
      "author": "2SWillow",
      "body": "I've heard nothing but fantastic reviews of both Brassard and Genoway \nI don't know where you're getting your information from and or simply not doing your own research",
      "score": 8,
      "created_utc": "2025-08-12T00:11:52Z"
    },
    {
      "id": "n872ul9",
      "author": "Potential-Stomach-62",
      "body": "Dr.Brassard girl myself. I love my results. My doctor handling my care post op said  recently I had healed amazingly and that everything looked amazing. I am almost 19 months post op now. There is nothing about me that I would change. I had posted pictures a while ago but didn’t just want to leave them up. I had many positive comments. I also know a bunch of women that went there and they are all happy with their results. I couldn’t be happier",
      "score": 5,
      "created_utc": "2025-08-11T23:12:09Z"
    },
    {
      "id": "n888j63",
      "author": "AtlasBlu45",
      "body": "We have 4 clinics in Canada that offer vaginoplasty:\n\n• Vancouver, BC - Dr. Genoway & Dr. Kavanagh:\nOnly available to BC residents. (I’m in ON, so I don’t have more info). Hair removal required (covered at government-approved electrologists by BC provincial insurance).\n\n• Montreal, QC - GRS Montreal, Dr. Brassard or Dr. Laungani:\nWhere most Canadians go to (accepts all provincial insurances). Consistent, functional results. Some bad reviews, but to be expected from a place that does 200+ surgeries a year. No prior hair removal required. Pretty quick waitlist (~9 months-1.5 years, give or take). Note: It’s currently taking longer for QC residents due to funding issues with provincial insurance.\n\n• Toronto, ON - Women’s College of Health (WCH), Dr. Krakowsky & Dr. Millman:\nOnly accepts OHIP (Ontario residents only). Some hair removal recommended, but not required. Slower intake/longer waitlist (~2-3 years, give or take).\n\n• Ottawa, ON - The Ottawa Hospital, Dr. Cormier:\nAgain, OHIP/Ontario residents only. New clinic and surgeon. No results or reviews to take into account. Very little information available (hopefully this speeds up as they get settled in). He does everything, according to what limited info we have: top surgery (MtF and FtM, which we do have results available), FFS, and bottom surgeries (again, both). Hair removal requirements unknown. Time to consultation/surgery unknown. He has consulted with FtM patients, but not MtF yet as far as we know.\n\nPersonal opinion:\nSome prefer WCH’s aesthetics over GRS Montreal; I don’t. Personally, I don’t find them that different (hot take perhaps), but I’d still pick GRS Montreal over them (that’s my Plan B). They’re not the prettiest (imo), but good. Plan A: I decided to give Dr. Cormier a shot. Been on the waitlist for a year (since Jul 2024), hoping to have a consultation soon, then hopefully surgery soon-ish after. We’ll see how it goes.",
      "score": 3,
      "created_utc": "2025-08-12T03:25:15Z"
    },
    {
      "id": "n86tnuy",
      "author": "TijayesPJs443",
      "body": "Definitely go through the wiki - it lists all Canadian SRS surgeons\n\nAgreed about GRS Montreal - it seems like 9/10 posts are aesthetically awful.",
      "score": 3,
      "created_utc": "2025-08-11T22:19:37Z"
    },
    {
      "id": "n883brm",
      "author": "AffectionateZoey",
      "body": "I had surgery in BC with Dr. Kavanagh and Dr. Genoway. Feel free to ask if you have questions. TL;DR nightmare booking/pre op communication situation, but actual results are really good, only minor aesthetic complications which I'm getting revised later this year.\n\n\nNote that I saw you mention OHIP; BC surgeons service BC exclusively. Barring specific circumstances if you're in Ontario you likely wouldn't be able to book with them regardless unless you moved here, and even then it's a several year wait.",
      "score": 1,
      "created_utc": "2025-08-12T02:50:50Z"
    },
    {
      "id": "n8asj4b",
      "author": "Medusa-mermaid",
      "body": "I had mine done in Vancouver with Dr. Genoway and Dr. Kavanagh. Very positive experience, and I love my results. Great followup care. Takes a little longer to get in with Vancouver gender care compared with Montreal, and I had to do hair removal in preparation for my surgery beforehand, but I'm happy with the route I took.",
      "score": 1,
      "created_utc": "2025-08-12T15:02:36Z"
    },
    {
      "id": "n873mxt",
      "author": "Superb_Ant7721",
      "body": "No Canada is not a good place for it, Thailand is ur best bet",
      "score": -5,
      "created_utc": "2025-08-11T23:16:43Z"
    },
    {
      "id": "n870etb",
      "author": "Ok-Kangaroo-3544",
      "body": "thanks. were they all done by brassard? i like the sound of consistency, i'm pretty new to srs and i just want something functional and reasonably pleasing aesthetically. i can't pay out of pocket either",
      "score": 2,
      "created_utc": "2025-08-11T22:58:06Z"
    },
    {
      "id": "n8boir6",
      "author": "Kurenai_Kamille",
      "body": "I've seen 3 up close and I did not witness consistency.",
      "score": 1,
      "created_utc": "2025-08-12T17:40:07Z"
    },
    {
      "id": "n88mt53",
      "author": "Mizzclawsgalore",
      "body": "The government covers hair removal in BC, so it's just a matter of getting it done at a government affiliated electrologist.\n\nMontreal is about 9-12 months right now. They're very fast. \n\nOHIP approval lasts 3 years, so WCH has said that that's the maximum you'll be waiting. They also don't require hair removal, but make it clear follicle scraping is not an infallible technique.",
      "score": 2,
      "created_utc": "2025-08-12T05:12:57Z"
    },
    {
      "id": "n86uism",
      "author": "Ok-Kangaroo-3544",
      "body": "will do. there was a fairly recent brassard post on here that blew up, the results looked incredible which made me wanna look into them",
      "score": 2,
      "created_utc": "2025-08-11T22:24:25Z"
    },
    {
      "id": "n888g2u",
      "author": "WHATSTHEYAAAMS",
      "body": "From my literal years of scouring this subreddit looking at SRS results, many of which have since been deleted/removed, I can vouch that GRS Montreal results are remarkably consistent aesthetically at least in what is posted online. However, this is not necessarily a good thing depending on what you consider 'reasonably pleasing aesthetically' - the vast majority of GRS Montreal results I've seen do not have fully defined inner labia (they're often missing altogether) and the inner labia merge together above the vaginal opening instead of below; the latter phenomenon can be visually distinctive and does not occur in natal vulvas. These are things that might not be aesthetically desirable to some.\n\nIn any case, if you can't pay out of pocket, GRS Montreal is A: probably your most reliable option, and B: probably your *only* option. Women's College Hospital in Toronto does SRS also but has a years-long waitlist and I don't know if they're adding patients to it.",
      "score": 4,
      "created_utc": "2025-08-12T03:24:40Z"
    },
    {
      "id": "n87gzfe",
      "author": "FlyingBread92",
      "body": "Mix of Brassard and Laungani. Personally I think Brassard has slightly better aesthetics from the ones I've seen on here, but they both use the same technique. I had mine with Laungani.",
      "score": 3,
      "created_utc": "2025-08-12T00:34:49Z"
    },
    {
      "id": "n8acnhq",
      "author": "AtlasBlu45",
      "body": "Thank you, I’ve made the corrections. I’ve also found that GRS Montreal is taking longer for QC residents currently because of issues with their provincial insurance funding.\n\nI must’ve misread the WCH guidebook, whoops.",
      "score": 1,
      "created_utc": "2025-08-12T13:39:28Z"
    },
    {
      "id": "n86v4co",
      "author": "TijayesPJs443",
      "body": "Could you link please?",
      "score": 1,
      "created_utc": "2025-08-11T22:27:48Z"
    },
    {
      "id": "n87073b",
      "author": "HiddenStill",
      "body": "You like playing Russian roulette?\n\nCan’t beat the price though.",
      "score": -6,
      "created_utc": "2025-08-11T22:56:54Z"
    },
    {
      "id": "n8a8fve",
      "author": "Ok-Kangaroo-3544",
      "body": "thank you",
      "score": 1,
      "created_utc": "2025-08-12T13:15:50Z"
    },
    {
      "id": "n8akoxo",
      "author": "GenevieveSapha",
      "body": "BA w/Laungani June 26th... waiting on bottom surgery w/Laungani also.",
      "score": 1,
      "created_utc": "2025-08-12T14:22:55Z"
    },
    {
      "id": "n86vni6",
      "author": "Ok-Kangaroo-3544",
      "body": "i dm'd",
      "score": 2,
      "created_utc": "2025-08-11T22:30:49Z"
    }
  ]
}